# IsVoidInstanceCuttingElement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InstanceVoidCutUtils..::..IsVoidInstanceCuttingElement Method
InstanceVoidCutUtils Class See Also
---
Indicates if the element is a family instance with unattached voids that can cut other elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool IsVoidInstanceCuttingElement(
	Element element
)
```

Visual Basic
---
```text
Public Shared Function IsVoidInstanceCuttingElement ( _
	element As Element _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsVoidInstanceCuttingElement(
	Element^ element
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..Element The cutting family instance
# ### Return Value
Returns true if the element is a family instance with unattached voids that can cut other elements.
# Remarks
A family instance can cut if the family has unattached voids and the family's parameter "Cut with Voids When Loaded" is checked.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
InstanceVoidCutUtils Class
Autodesk.Revit.DB Namespace